{
    "projects": [
        {
            "id": 0,
            "project_name": "Random Quote Generator",
            "description": [
                "The Random Quote Generator is a basic display of JavaScript syntax and data structures that utilizes a preformatted HTML template with CSS to render a random quote from a provided array of quotes. The quotes will change at a predetermined interval, and custom CSS styles and jQuery animations have been added to give the project a bit of custom flair.",
                "Font and button font color are set dynamically to white or black depending on the shade of the random background color, and the button is shaded to match. I use Bootstrap to make the app responsive, and have included a mobile image below."
            ],
            "technologies": [
                "HyperTextMarkupLanguage (HTML)",
                "Cascading Style Sheets (CSS)",
                "JavaScript (JS)",
                "jQuery JavaScript Library (jQuery)",
                "Bootstrap (B)"
            ],
            "live_link": "https://burro1220.github.io/Treehouse-Project1/",
            "github_link": "https://github.com/burro1220/Treehouse-Project1/",
            "image_urls": [
                "/static/images/p1img0.jpg",
                "/static/images/p1img1.jpg",
                "/static/images/p1img2.jpg"
            ]
        },
        {
            "id": 1,
            "project_name": "Dynamic List Pagination/Filtering",
            "description": [
                "Long lists don't make for a good user experience. In this project, I enhanced the usability of a web page that is displaying too much information at once. Using only plain vanilla JavaScript, I added a popular web development technique known as 'pagination.' All improvements adhere to 'progressive enhancement.' This means that the page is not dependent on the JavaScript added, and all functionality is present to the user if JavaScript is disabled in their browser. The solution is dynamic, and works with a list of any number of students.",
                "As a bonus, a search input field is dynamically added, giving the user the ability to filter students by name. Pagination dynamically modifies the number of appended links dependent upon the number of pages needed to show the results. Finally, custom CSS rules have been added to give the project a personal flair."
            ],
            "technologies": [
                "HyperTextMarkupLanguage (HTML)",
                "Cascading Style Sheets (CSS)",
                "JavaScript (JS)"
            ],
            "live_link": "https://burro1220.github.io/Project2/",
            "github_link": "https://github.com/burro1220/Project2/",
            "image_urls": [
                "/static/images/p2img0.jpg",
                "/static/images/p2img1.jpg",
                "/static/images/p2img2.jpg"
            ]
        },
        {
            "id": 2,
            "project_name": "Form w/ Regex Validation",
            "description": [
                "The ability to create custom, dynamic forms with proper validation techniques is essential to any Full Stack JavaScript developer. This project utilizes jQuery to create a prototype for a conference sign-up application.",
                "Fields appear dynamically based on user selection. The use of regular expressions to validate each field generates informative errors to guide the user."
            ],
            "technologies": [
                "HyperTextMarkupLanguage (HTML)",
                "Cascading Style Sheets (CSS)",
                "JavaScript (JS)",
                "jQuery JavaScript Library (jQuery)"
            ],
            "live_link": "https://burro1220.github.io/Project-3/",
            "github_link": "https://github.com/burro1220/Project-3",
            "image_urls": [
                "/static/images/p3img0.jpg",
                "/static/images/p3img1.jpg",
                "/static/images/p3img2.jpg"
            ] 
        },
        {
            "id": 3,
            "project_name": "Phrase Hunter Interactive Game",
            "description": [
                "This project utilizes an understanding of JavaScript and Object-Oriented Programming (OOP) to build a word guessing game from scratch. Learning to describe real-world processes using objects to create dynamic, reusable pieces of code is intriguing to me. Once a developer begins to understand that anything can be an object, the sky becomes the limit.",
                "The combined use of classes, properties and methods bring the game to life, along with some custom CSS stylings by yours truly."
            ],
            "technologies": [
                "HyperTextMarkupLanguage (HTML)",
                "Cascading Style Sheets (CSS)",
                "JavaScript (JS)",
                "jQuery Javascript Library"
            ],
            "live_link": "https://burro1220.github.io/Project-4/",
            "github_link": "https://github.com/burro1220/Project-4",
            "image_urls": [
                "/static/images/p4img0.jpg",
                "/static/images/p4img1.jpg",
                "/static/images/p4img2.jpg"
            ]
        },
        {
            "id": 4,
            "project_name": "Random User Fetch Application",
            "description": [
                "To me, the power to communicate granularly with APIs is one of the most intriguing powers of a developer. Simple interaction with vast and complex databases wields the ability to create powerful tools that display meaningful and relevant information quickly and easily.",
                "This project utilizes the Random User Generator API to grab JSON data for 12 random 'employees' to display an employee directory, complete with on-click modal display."
            ],
            "technologies": [
                "HyperTextMarkupLanguage (HTML)",
                "Cascading Style Sheets (CSS)",
                "JavaScript (JS)",
                "jQuery JavaScript Library (jQuery)"
            ],
            "live_link": "https://burro1220.github.io/Project-5/",
            "github_link": "https://github.com/burro1220/Project-5",
            "image_urls": [
                "/static/images/p5img0.jpg",
                "/static/images/p5img1.jpg",
                "/static/images/p5img2.jpg"
            ]
        },
        {
            "id": 5,
            "project_name": "My Websites",
            "description": [
                "I have been providing website design and hosting services as a subservice of my computer repair business for almost 10 years. In that time, I have learned a lot about what it takes not only to design a Google-friendly website, but to maintain it over time.",
                "My development path has taken me from Joomla, back in the days before WordPress became King, to a minimalist, Bootstrap based phase and then into Wordpress SEO and performance optimization.",
                "For a closer look, please see the Portfolio page of my business website via the Live Demo button."
            ],
            "technologies": [
                "Apache",
                "MySQL",
                "PHP",
                "Website Hosting",
                "DNS Configuration",
                "Joomla",
                "WordPress",
                "Search Engine Optimization (SEO)",
                "Website Performance Optimization",
                "Cascading Style Sheets (CSS)",
                "JavaScript (JS)",
                "jQuery JavaScript Library (jQuery)",
                "Bootstrap (B)"
            ],
            "live_link": "http://webdesign.computersolution.tech/",
            "github_link": "hhttp://www.computersolution.tech/",
            "image_urls": [
                "/static/images/p6img0.jpg",
                "/static/images/p6img1.jpg",
                "/static/images/p6img2.jpg"
            ]
        }
    ]
}